#删除质控码
import pandas as pd
import os
path ='G:\\气象数据\\气象预测\\winter_olympic_obs_hourly(1)\\hour_data02.0\\'
files = os.listdir(path)
files_csv =list(filter(lambda x:x[-4:]=='.csv',files))
for file in files_csv:
  # data_dir =path +file
  data_dir = path + file
  data_dir01 ='G:\\气象数据\\气象预测\\winter_olympic_obs_hourly(1)\\hour_data03\\' + file
  df = pd.read_csv(data_dir, encoding='UTF-8')
  # df =df.drop(['草面最低温度','草面最低温度出现时间','草面最高温度','草面最高温度出现时间','草面温度','雪深','最小能见度','最小能见度出现时间','320厘米地温','40厘米地温','5厘米地温','80厘米地温','地表最低温度',
  #              '地表最低温度出现时间','地表最高温度','地表最高温度出现时间','地表温度','定时能见度'])
  df = df.drop(['10分钟平均水平能见度质控码','10分钟平均风速质控码','10分钟风向质控码','10厘米地温质控码',
             '15厘米地温质控码','160厘米地温质控码','20厘米地温质控码','2分钟平均风速质控码','2分钟风向质控码','320厘米地温质控码','40厘米地温质控码',
             '5厘米地温质控码','80厘米地温质控码','地表最低温度出现时间质控码','地表最低温度质控码','地表最高温度出现时间质控码','地表最高温度质控码',
             '地表温度质控码','定时能见度质控码','小时降水量质控码','最低本站气压出现时间质控码','最低本站气压质控码','最低气温出现时间质控码','最低气温质控码',
             '最大风速出现时间质控码','最大风速的风向质控码','1分钟平均水平能见度质控码','最大风速质控码','最小相对湿度出现时间质控码','最小相对湿度质控码','最小能见度出现时间质控码',
             '最小能见度质控码','最高本站气压出现时间 质控码','最高本站气压质控码','最高气温出现时间质控码','最高气温质控码','本站气压质控码','极大风速出现时间质控码',
             '极大风速的风向质控码','极大风速质控码','正点气温质控码','相对湿度质控码','瞬时风向质控码','瞬时风速质控码','草面最低温度出现时间质控码','草面最低温度质控码',
             '草面最高温度出现时间质控码','草面最高温度质控码','草面温度质控码','雪深质控码','观测时间.1'],axis= 1)
  # df = df.replace('//', '0')  #文件 02
  # df =df.replace('/', '0')  #文件 02.0
  df=df.fillna(df.mean())
  df = df.to_csv(data_dir01,index=0)
